TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.6.LTS *
       3                    ;* Date/Time created: Tue Oct 17 14:35:08 2023                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\OJIN0001\Downloads\Lab5_2107\Lab5_2107\Lab1_C_Progr
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("Clock_Delay1ms")

     879 0000016a 9900              LDR       A2, [SP, #0]          ; [DPU_3_PIPE] |241|  ; [ORIG 16-BIT INS]
     880 0000016c 9801              LDR       A1, [SP, #4]          ; [DPU_3_PIPE] |241|  ; [ORIG 16-BIT INS]
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   17

     881 0000016e 1840              ADDS      A1, A1, A2            ; [DPU_3_PIPE] |241|  ; [ORIG 16-BIT INS]
     882 00000170 9002              STR       A1, [SP, #8]          ; [DPU_3_PIPE] |241|  ; [ORIG 16-BIT INS]
     883                    ;* --------------------------------------------------------------------------*
     884 00000172           ||$C$L10||:    
     885                            .dwpsn  file "../main.c",line 244,column 5,is_stmt,isa 1
     886 00000172 9802              LDR       A1, [SP, #8]          ; [DPU_3_PIPE] |244|  ; [ORIG 16-BIT INS]
     887 00000174 9000              STR       A1, [SP, #0]          ; [DPU_3_PIPE] |244|  ; [ORIG 16-BIT INS]
     888                            .dwpsn  file "../main.c",line 245,column 1,is_stmt,isa 1
     889 00000176 B004              ADD       SP, SP, #16           ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
     890                            .dwcfi  cfa_offset, 0
     891                    $C$DW$47        .dwtag  DW_TAG_TI_branch
     892                            .dwattr $C$DW$47, DW_AT_low_pc(0x00)
     893                            .dwattr $C$DW$47, DW_AT_TI_return
     894                    
     895 00000178 4770              BX        LR                    ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
     896                            ; BRANCH OCCURS                  ; [] 
     897                            .dwattr $C$DW$43, DW_AT_TI_end_file("../main.c")
     898                            .dwattr $C$DW$43, DW_AT_TI_end_line(0xf5)
     899                            .dwattr $C$DW$43, DW_AT_TI_end_column(0x01)
     900                            .dwendentry
     901                            .dwendtag $C$DW$43
     902                    
     903                    ;******************************************************************************
     904                    ;* CONSTANT TABLE                                                             *
     905                    ;******************************************************************************
     906 0000017a                   .sect   ".text"
     907                            .align  4
     908 0000017a 4C0C46C0  ||$C$CON2||:    .bits   1073761292,32
         0000017e 00004000 
     909                            .align  4
     910 0000017e 4C024000  ||$C$CON5||:    .bits   1073761282,32
         00000182 00004000 
     911                            .align  4
     912 00000182 4C034000  ||$C$CON11||:   .bits   1073761283,32
         00000186 00004000 
     913                            .align  4
     914 00000186 00004000! ||$C$CON12||:   .bits   ||$P$T0$1||,32
         0000018a 00000000 
     915                    ;*****************************************************************************
     916                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
     917                    ;*****************************************************************************
     918                            .global Clock_Delay1ms
     919                    
     920                    ;******************************************************************************
     921                    ;* BUILD ATTRIBUTES                                                           *
     922                    ;******************************************************************************
     923                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     924                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     925                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     926                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     927                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     928                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     929                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     930                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     931                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(3)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   18

     932                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     933                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     934                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     935                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     936                    
     937                    ;******************************************************************************
     938                    ;* TYPE INFORMATION                                                           *
     939                    ;******************************************************************************
     940                    
     941                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     942                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x1e)
     943                    $C$DW$48        .dwtag  DW_TAG_member
     944                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$20)
     945                            .dwattr $C$DW$48, DW_AT_name("IN")
     946                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("IN")
     947                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     949                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     950                            .dwattr $C$DW$48, DW_AT_decl_line(0x288)
     951                            .dwattr $C$DW$48, DW_AT_decl_column(0x0f)
     952                    
     953                    $C$DW$49        .dwtag  DW_TAG_member
     954                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     955                            .dwattr $C$DW$49, DW_AT_name("RESERVED0")
     956                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("RESERVED0")
     957                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     958                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     959                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     960                            .dwattr $C$DW$49, DW_AT_decl_line(0x289)
     961                            .dwattr $C$DW$49, DW_AT_decl_column(0x0b)
     962                    
     963                    $C$DW$50        .dwtag  DW_TAG_member
     964                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     965                            .dwattr $C$DW$50, DW_AT_name("OUT")
     966                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("OUT")
     967                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     968                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     969                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     970                            .dwattr $C$DW$50, DW_AT_decl_line(0x28a)
     971                            .dwattr $C$DW$50, DW_AT_decl_column(0x10)
     972                    
     973                    $C$DW$51        .dwtag  DW_TAG_member
     974                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     975                            .dwattr $C$DW$51, DW_AT_name("RESERVED1")
     976                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("RESERVED1")
     977                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     978                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     979                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     980                            .dwattr $C$DW$51, DW_AT_decl_line(0x28b)
     981                            .dwattr $C$DW$51, DW_AT_decl_column(0x0b)
     982                    
     983                    $C$DW$52        .dwtag  DW_TAG_member
     984                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
     985                            .dwattr $C$DW$52, DW_AT_name("DIR")
     986                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("DIR")
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   19

     987                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     988                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     989                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     990                            .dwattr $C$DW$52, DW_AT_decl_line(0x28c)
     991                            .dwattr $C$DW$52, DW_AT_decl_column(0x10)
     992                    
     993                    $C$DW$53        .dwtag  DW_TAG_member
     994                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     995                            .dwattr $C$DW$53, DW_AT_name("RESERVED2")
     996                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("RESERVED2")
     997                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     998                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     999                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1000                            .dwattr $C$DW$53, DW_AT_decl_line(0x28d)
    1001                            .dwattr $C$DW$53, DW_AT_decl_column(0x0b)
    1002                    
    1003                    $C$DW$54        .dwtag  DW_TAG_member
    1004                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
    1005                            .dwattr $C$DW$54, DW_AT_name("REN")
    1006                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("REN")
    1007                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1008                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1009                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1010                            .dwattr $C$DW$54, DW_AT_decl_line(0x28e)
    1011                            .dwattr $C$DW$54, DW_AT_decl_column(0x10)
    1012                    
    1013                    $C$DW$55        .dwtag  DW_TAG_member
    1014                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1015                            .dwattr $C$DW$55, DW_AT_name("RESERVED3")
    1016                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("RESERVED3")
    1017                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1018                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1019                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1020                            .dwattr $C$DW$55, DW_AT_decl_line(0x28f)
    1021                            .dwattr $C$DW$55, DW_AT_decl_column(0x0b)
    1022                    
    1023                    $C$DW$56        .dwtag  DW_TAG_member
    1024                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
    1025                            .dwattr $C$DW$56, DW_AT_name("DS")
    1026                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("DS")
    1027                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1028                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1029                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1030                            .dwattr $C$DW$56, DW_AT_decl_line(0x290)
    1031                            .dwattr $C$DW$56, DW_AT_decl_column(0x10)
    1032                    
    1033                    $C$DW$57        .dwtag  DW_TAG_member
    1034                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1035                            .dwattr $C$DW$57, DW_AT_name("RESERVED4")
    1036                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("RESERVED4")
    1037                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1038                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1039                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1040                            .dwattr $C$DW$57, DW_AT_decl_line(0x291)
    1041                            .dwattr $C$DW$57, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   20

    1042                    
    1043                    $C$DW$58        .dwtag  DW_TAG_member
    1044                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
    1045                            .dwattr $C$DW$58, DW_AT_name("SEL0")
    1046                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("SEL0")
    1047                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1048                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1049                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1050                            .dwattr $C$DW$58, DW_AT_decl_line(0x292)
    1051                            .dwattr $C$DW$58, DW_AT_decl_column(0x10)
    1052                    
    1053                    $C$DW$59        .dwtag  DW_TAG_member
    1054                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1055                            .dwattr $C$DW$59, DW_AT_name("RESERVED5")
    1056                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("RESERVED5")
    1057                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1058                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1059                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1060                            .dwattr $C$DW$59, DW_AT_decl_line(0x293)
    1061                            .dwattr $C$DW$59, DW_AT_decl_column(0x0b)
    1062                    
    1063                    $C$DW$60        .dwtag  DW_TAG_member
    1064                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
    1065                            .dwattr $C$DW$60, DW_AT_name("SEL1")
    1066                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("SEL1")
    1067                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1068                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1069                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1070                            .dwattr $C$DW$60, DW_AT_decl_line(0x294)
    1071                            .dwattr $C$DW$60, DW_AT_decl_column(0x10)
    1072                    
    1073                    $C$DW$61        .dwtag  DW_TAG_member
    1074                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1075                            .dwattr $C$DW$61, DW_AT_name("RESERVED6")
    1076                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("RESERVED6")
    1077                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1078                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1079                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1080                            .dwattr $C$DW$61, DW_AT_decl_line(0x295)
    1081                            .dwattr $C$DW$61, DW_AT_decl_column(0x0b)
    1082                    
    1083                    $C$DW$62        .dwtag  DW_TAG_member
    1084                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$23)
    1085                            .dwattr $C$DW$62, DW_AT_name("IV")
    1086                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("IV")
    1087                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1088                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1089                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1090                            .dwattr $C$DW$62, DW_AT_decl_line(0x296)
    1091                            .dwattr $C$DW$62, DW_AT_decl_column(0x11)
    1092                    
    1093                    $C$DW$63        .dwtag  DW_TAG_member
    1094                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$24)
    1095                            .dwattr $C$DW$63, DW_AT_name("RESERVED7")
    1096                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("RESERVED7")
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   21

    1097                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1098                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1099                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1100                            .dwattr $C$DW$63, DW_AT_decl_line(0x297)
    1101                            .dwattr $C$DW$63, DW_AT_decl_column(0x0b)
    1102                    
    1103                    $C$DW$64        .dwtag  DW_TAG_member
    1104                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$21)
    1105                            .dwattr $C$DW$64, DW_AT_name("SELC")
    1106                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("SELC")
    1107                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1108                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1109                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1110                            .dwattr $C$DW$64, DW_AT_decl_line(0x298)
    1111                            .dwattr $C$DW$64, DW_AT_decl_column(0x10)
    1112                    
    1113                    $C$DW$65        .dwtag  DW_TAG_member
    1114                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1115                            .dwattr $C$DW$65, DW_AT_name("RESERVED8")
    1116                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("RESERVED8")
    1117                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1118                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1119                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1120                            .dwattr $C$DW$65, DW_AT_decl_line(0x299)
    1121                            .dwattr $C$DW$65, DW_AT_decl_column(0x0b)
    1122                    
    1123                    $C$DW$66        .dwtag  DW_TAG_member
    1124                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
    1125                            .dwattr $C$DW$66, DW_AT_name("IES")
    1126                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("IES")
    1127                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1128                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1129                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1130                            .dwattr $C$DW$66, DW_AT_decl_line(0x29a)
    1131                            .dwattr $C$DW$66, DW_AT_decl_column(0x10)
    1132                    
    1133                    $C$DW$67        .dwtag  DW_TAG_member
    1134                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1135                            .dwattr $C$DW$67, DW_AT_name("RESERVED9")
    1136                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("RESERVED9")
    1137                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1138                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1139                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1140                            .dwattr $C$DW$67, DW_AT_decl_line(0x29b)
    1141                            .dwattr $C$DW$67, DW_AT_decl_column(0x0b)
    1142                    
    1143                    $C$DW$68        .dwtag  DW_TAG_member
    1144                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
    1145                            .dwattr $C$DW$68, DW_AT_name("IE")
    1146                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("IE")
    1147                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1148                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1149                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1150                            .dwattr $C$DW$68, DW_AT_decl_line(0x29c)
    1151                            .dwattr $C$DW$68, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   22

    1152                    
    1153                    $C$DW$69        .dwtag  DW_TAG_member
    1154                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1155                            .dwattr $C$DW$69, DW_AT_name("RESERVED10")
    1156                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("RESERVED10")
    1157                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1158                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1159                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1160                            .dwattr $C$DW$69, DW_AT_decl_line(0x29d)
    1161                            .dwattr $C$DW$69, DW_AT_decl_column(0x0b)
    1162                    
    1163                    $C$DW$70        .dwtag  DW_TAG_member
    1164                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1165                            .dwattr $C$DW$70, DW_AT_name("IFG")
    1166                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("IFG")
    1167                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1168                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1169                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1170                            .dwattr $C$DW$70, DW_AT_decl_line(0x29e)
    1171                            .dwattr $C$DW$70, DW_AT_decl_column(0x10)
    1172                    
    1173                    $C$DW$71        .dwtag  DW_TAG_member
    1174                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1175                            .dwattr $C$DW$71, DW_AT_name("RESERVED11")
    1176                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED11")
    1177                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1178                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1179                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1180                            .dwattr $C$DW$71, DW_AT_decl_line(0x29f)
    1181                            .dwattr $C$DW$71, DW_AT_decl_column(0x0b)
    1182                    
    1183                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1184                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x287)
    1185                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1186                            .dwendtag $C$DW$T$25
    1187                    
    1188                    $C$DW$T$172     .dwtag  DW_TAG_typedef
    1189                            .dwattr $C$DW$T$172, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    1190                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$25)
    1191                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    1192                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1193                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x2a0)
    1194                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
    1195                    
    1196                    
    1197                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1198                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
    1199                    $C$DW$72        .dwtag  DW_TAG_member
    1200                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1201                            .dwattr $C$DW$72, DW_AT_name("RESERVED0")
    1202                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("RESERVED0")
    1203                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1204                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1205                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1206                            .dwattr $C$DW$72, DW_AT_decl_line(0x2a3)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   23

    1207                            .dwattr $C$DW$72, DW_AT_decl_column(0x0b)
    1208                    
    1209                    $C$DW$73        .dwtag  DW_TAG_member
    1210                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
    1211                            .dwattr $C$DW$73, DW_AT_name("IN")
    1212                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("IN")
    1213                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1214                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1215                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1216                            .dwattr $C$DW$73, DW_AT_decl_line(0x2a4)
    1217                            .dwattr $C$DW$73, DW_AT_decl_column(0x0f)
    1218                    
    1219                    $C$DW$74        .dwtag  DW_TAG_member
    1220                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1221                            .dwattr $C$DW$74, DW_AT_name("RESERVED1")
    1222                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("RESERVED1")
    1223                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1224                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1225                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1226                            .dwattr $C$DW$74, DW_AT_decl_line(0x2a5)
    1227                            .dwattr $C$DW$74, DW_AT_decl_column(0x0b)
    1228                    
    1229                    $C$DW$75        .dwtag  DW_TAG_member
    1230                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
    1231                            .dwattr $C$DW$75, DW_AT_name("OUT")
    1232                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("OUT")
    1233                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1234                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1235                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1236                            .dwattr $C$DW$75, DW_AT_decl_line(0x2a6)
    1237                            .dwattr $C$DW$75, DW_AT_decl_column(0x10)
    1238                    
    1239                    $C$DW$76        .dwtag  DW_TAG_member
    1240                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1241                            .dwattr $C$DW$76, DW_AT_name("RESERVED2")
    1242                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("RESERVED2")
    1243                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1244                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1245                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1246                            .dwattr $C$DW$76, DW_AT_decl_line(0x2a7)
    1247                            .dwattr $C$DW$76, DW_AT_decl_column(0x0b)
    1248                    
    1249                    $C$DW$77        .dwtag  DW_TAG_member
    1250                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
    1251                            .dwattr $C$DW$77, DW_AT_name("DIR")
    1252                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("DIR")
    1253                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1254                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1255                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1256                            .dwattr $C$DW$77, DW_AT_decl_line(0x2a8)
    1257                            .dwattr $C$DW$77, DW_AT_decl_column(0x10)
    1258                    
    1259                    $C$DW$78        .dwtag  DW_TAG_member
    1260                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1261                            .dwattr $C$DW$78, DW_AT_name("RESERVED3")
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   24

    1262                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("RESERVED3")
    1263                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1264                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1265                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1266                            .dwattr $C$DW$78, DW_AT_decl_line(0x2a9)
    1267                            .dwattr $C$DW$78, DW_AT_decl_column(0x0b)
    1268                    
    1269                    $C$DW$79        .dwtag  DW_TAG_member
    1270                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1271                            .dwattr $C$DW$79, DW_AT_name("REN")
    1272                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("REN")
    1273                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1274                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1275                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1276                            .dwattr $C$DW$79, DW_AT_decl_line(0x2aa)
    1277                            .dwattr $C$DW$79, DW_AT_decl_column(0x10)
    1278                    
    1279                    $C$DW$80        .dwtag  DW_TAG_member
    1280                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1281                            .dwattr $C$DW$80, DW_AT_name("RESERVED4")
    1282                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("RESERVED4")
    1283                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1284                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1285                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1286                            .dwattr $C$DW$80, DW_AT_decl_line(0x2ab)
    1287                            .dwattr $C$DW$80, DW_AT_decl_column(0x0b)
    1288                    
    1289                    $C$DW$81        .dwtag  DW_TAG_member
    1290                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
    1291                            .dwattr $C$DW$81, DW_AT_name("DS")
    1292                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("DS")
    1293                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1294                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1295                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1296                            .dwattr $C$DW$81, DW_AT_decl_line(0x2ac)
    1297                            .dwattr $C$DW$81, DW_AT_decl_column(0x10)
    1298                    
    1299                    $C$DW$82        .dwtag  DW_TAG_member
    1300                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1301                            .dwattr $C$DW$82, DW_AT_name("RESERVED5")
    1302                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("RESERVED5")
    1303                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1304                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1305                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1306                            .dwattr $C$DW$82, DW_AT_decl_line(0x2ad)
    1307                            .dwattr $C$DW$82, DW_AT_decl_column(0x0b)
    1308                    
    1309                    $C$DW$83        .dwtag  DW_TAG_member
    1310                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1311                            .dwattr $C$DW$83, DW_AT_name("SEL0")
    1312                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("SEL0")
    1313                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1314                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1315                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1316                            .dwattr $C$DW$83, DW_AT_decl_line(0x2ae)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   25

    1317                            .dwattr $C$DW$83, DW_AT_decl_column(0x10)
    1318                    
    1319                    $C$DW$84        .dwtag  DW_TAG_member
    1320                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1321                            .dwattr $C$DW$84, DW_AT_name("RESERVED6")
    1322                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("RESERVED6")
    1323                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1324                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1325                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1326                            .dwattr $C$DW$84, DW_AT_decl_line(0x2af)
    1327                            .dwattr $C$DW$84, DW_AT_decl_column(0x0b)
    1328                    
    1329                    $C$DW$85        .dwtag  DW_TAG_member
    1330                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
    1331                            .dwattr $C$DW$85, DW_AT_name("SEL1")
    1332                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("SEL1")
    1333                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1334                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1335                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1336                            .dwattr $C$DW$85, DW_AT_decl_line(0x2b0)
    1337                            .dwattr $C$DW$85, DW_AT_decl_column(0x10)
    1338                    
    1339                    $C$DW$86        .dwtag  DW_TAG_member
    1340                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$26)
    1341                            .dwattr $C$DW$86, DW_AT_name("RESERVED7")
    1342                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("RESERVED7")
    1343                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1344                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1345                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1346                            .dwattr $C$DW$86, DW_AT_decl_line(0x2b1)
    1347                            .dwattr $C$DW$86, DW_AT_decl_column(0x0b)
    1348                    
    1349                    $C$DW$87        .dwtag  DW_TAG_member
    1350                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
    1351                            .dwattr $C$DW$87, DW_AT_name("SELC")
    1352                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("SELC")
    1353                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1354                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1355                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1356                            .dwattr $C$DW$87, DW_AT_decl_line(0x2b2)
    1357                            .dwattr $C$DW$87, DW_AT_decl_column(0x10)
    1358                    
    1359                    $C$DW$88        .dwtag  DW_TAG_member
    1360                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1361                            .dwattr $C$DW$88, DW_AT_name("RESERVED8")
    1362                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("RESERVED8")
    1363                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1364                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1365                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1366                            .dwattr $C$DW$88, DW_AT_decl_line(0x2b3)
    1367                            .dwattr $C$DW$88, DW_AT_decl_column(0x0b)
    1368                    
    1369                    $C$DW$89        .dwtag  DW_TAG_member
    1370                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
    1371                            .dwattr $C$DW$89, DW_AT_name("IES")
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   26

    1372                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("IES")
    1373                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1374                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1375                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1376                            .dwattr $C$DW$89, DW_AT_decl_line(0x2b4)
    1377                            .dwattr $C$DW$89, DW_AT_decl_column(0x10)
    1378                    
    1379                    $C$DW$90        .dwtag  DW_TAG_member
    1380                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1381                            .dwattr $C$DW$90, DW_AT_name("RESERVED9")
    1382                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("RESERVED9")
    1383                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1384                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1385                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1386                            .dwattr $C$DW$90, DW_AT_decl_line(0x2b5)
    1387                            .dwattr $C$DW$90, DW_AT_decl_column(0x0b)
    1388                    
    1389                    $C$DW$91        .dwtag  DW_TAG_member
    1390                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
    1391                            .dwattr $C$DW$91, DW_AT_name("IE")
    1392                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("IE")
    1393                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1394                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1395                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1396                            .dwattr $C$DW$91, DW_AT_decl_line(0x2b6)
    1397                            .dwattr $C$DW$91, DW_AT_decl_column(0x10)
    1398                    
    1399                    $C$DW$92        .dwtag  DW_TAG_member
    1400                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1401                            .dwattr $C$DW$92, DW_AT_name("RESERVED10")
    1402                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("RESERVED10")
    1403                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1404                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1405                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1406                            .dwattr $C$DW$92, DW_AT_decl_line(0x2b7)
    1407                            .dwattr $C$DW$92, DW_AT_decl_column(0x0b)
    1408                    
    1409                    $C$DW$93        .dwtag  DW_TAG_member
    1410                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    1411                            .dwattr $C$DW$93, DW_AT_name("IFG")
    1412                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("IFG")
    1413                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1414                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1415                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1416                            .dwattr $C$DW$93, DW_AT_decl_line(0x2b8)
    1417                            .dwattr $C$DW$93, DW_AT_decl_column(0x10)
    1418                    
    1419                    $C$DW$94        .dwtag  DW_TAG_member
    1420                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$23)
    1421                            .dwattr $C$DW$94, DW_AT_name("IV")
    1422                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("IV")
    1423                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1424                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1425                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1426                            .dwattr $C$DW$94, DW_AT_decl_line(0x2b9)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   27

    1427                            .dwattr $C$DW$94, DW_AT_decl_column(0x10)
    1428                    
    1429                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1430                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2a2)
    1431                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1432                            .dwendtag $C$DW$T$27
    1433                    
    1434                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    1435                            .dwattr $C$DW$T$174, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    1436                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$27)
    1437                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    1438                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1439                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x2ba)
    1440                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x03)
    1441                    
    1442                    
    1443                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1444                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1445                    $C$DW$95        .dwtag  DW_TAG_member
    1446                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$28)
    1447                            .dwattr $C$DW$95, DW_AT_name("_reserved0")
    1448                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("_reserved0")
    1449                            .dwattr $C$DW$95, DW_AT_bit_offset(0x10)
    1450                            .dwattr $C$DW$95, DW_AT_bit_size(0x10)
    1451                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1453                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1454                            .dwattr $C$DW$95, DW_AT_decl_line(0x105)
    1455                            .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1456                    
    1457                    $C$DW$96        .dwtag  DW_TAG_member
    1458                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
    1459                            .dwattr $C$DW$96, DW_AT_name("GE")
    1460                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("GE")
    1461                            .dwattr $C$DW$96, DW_AT_bit_offset(0x0c)
    1462                            .dwattr $C$DW$96, DW_AT_bit_size(0x04)
    1463                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1465                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1466                            .dwattr $C$DW$96, DW_AT_decl_line(0x106)
    1467                            .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1468                    
    1469                    $C$DW$97        .dwtag  DW_TAG_member
    1470                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$28)
    1471                            .dwattr $C$DW$97, DW_AT_name("_reserved1")
    1472                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("_reserved1")
    1473                            .dwattr $C$DW$97, DW_AT_bit_offset(0x05)
    1474                            .dwattr $C$DW$97, DW_AT_bit_size(0x07)
    1475                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1477                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1478                            .dwattr $C$DW$97, DW_AT_decl_line(0x107)
    1479                            .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1480                    
    1481                    $C$DW$98        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1482                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$28)
    1483                            .dwattr $C$DW$98, DW_AT_name("Q")
    1484                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("Q")
    1485                            .dwattr $C$DW$98, DW_AT_bit_offset(0x04)
    1486                            .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1487                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1488                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1489                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1490                            .dwattr $C$DW$98, DW_AT_decl_line(0x108)
    1491                            .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1492                    
    1493                    $C$DW$99        .dwtag  DW_TAG_member
    1494                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$28)
    1495                            .dwattr $C$DW$99, DW_AT_name("V")
    1496                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("V")
    1497                            .dwattr $C$DW$99, DW_AT_bit_offset(0x03)
    1498                            .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1499                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1501                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1502                            .dwattr $C$DW$99, DW_AT_decl_line(0x109)
    1503                            .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1504                    
    1505                    $C$DW$100       .dwtag  DW_TAG_member
    1506                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$28)
    1507                            .dwattr $C$DW$100, DW_AT_name("C")
    1508                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("C")
    1509                            .dwattr $C$DW$100, DW_AT_bit_offset(0x02)
    1510                            .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1511                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1513                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1514                            .dwattr $C$DW$100, DW_AT_decl_line(0x10a)
    1515                            .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1516                    
    1517                    $C$DW$101       .dwtag  DW_TAG_member
    1518                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$28)
    1519                            .dwattr $C$DW$101, DW_AT_name("Z")
    1520                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("Z")
    1521                            .dwattr $C$DW$101, DW_AT_bit_offset(0x01)
    1522                            .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1523                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1525                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1526                            .dwattr $C$DW$101, DW_AT_decl_line(0x10b)
    1527                            .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1528                    
    1529                    $C$DW$102       .dwtag  DW_TAG_member
    1530                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$28)
    1531                            .dwattr $C$DW$102, DW_AT_name("N")
    1532                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("N")
    1533                            .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1534                            .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1535                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1537                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1538                            .dwattr $C$DW$102, DW_AT_decl_line(0x10c)
    1539                            .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1540                    
    1541                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1542                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x104)
    1543                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    1544                            .dwendtag $C$DW$T$29
    1545                    
    1546                    
    1547                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1548                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1549                    $C$DW$103       .dwtag  DW_TAG_member
    1550                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$28)
    1551                            .dwattr $C$DW$103, DW_AT_name("ISR")
    1552                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("ISR")
    1553                            .dwattr $C$DW$103, DW_AT_bit_offset(0x17)
    1554                            .dwattr $C$DW$103, DW_AT_bit_size(0x09)
    1555                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1556                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1557                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1558                            .dwattr $C$DW$103, DW_AT_decl_line(0x12c)
    1559                            .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1560                    
    1561                    $C$DW$104       .dwtag  DW_TAG_member
    1562                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$28)
    1563                            .dwattr $C$DW$104, DW_AT_name("_reserved0")
    1564                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("_reserved0")
    1565                            .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1566                            .dwattr $C$DW$104, DW_AT_bit_size(0x17)
    1567                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1569                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1570                            .dwattr $C$DW$104, DW_AT_decl_line(0x12d)
    1571                            .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1572                    
    1573                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1574                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x12b)
    1575                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    1576                            .dwendtag $C$DW$T$30
    1577                    
    1578                    
    1579                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1580                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1581                    $C$DW$105       .dwtag  DW_TAG_member
    1582                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    1583                            .dwattr $C$DW$105, DW_AT_name("ISR")
    1584                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("ISR")
    1585                            .dwattr $C$DW$105, DW_AT_bit_offset(0x17)
    1586                            .dwattr $C$DW$105, DW_AT_bit_size(0x09)
    1587                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1588                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1589                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1590                            .dwattr $C$DW$105, DW_AT_decl_line(0x13e)
    1591                            .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1592                    
    1593                    $C$DW$106       .dwtag  DW_TAG_member
    1594                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$28)
    1595                            .dwattr $C$DW$106, DW_AT_name("_reserved0")
    1596                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("_reserved0")
    1597                            .dwattr $C$DW$106, DW_AT_bit_offset(0x16)
    1598                            .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1599                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1601                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1602                            .dwattr $C$DW$106, DW_AT_decl_line(0x13f)
    1603                            .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1604                    
    1605                    $C$DW$107       .dwtag  DW_TAG_member
    1606                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$28)
    1607                            .dwattr $C$DW$107, DW_AT_name("ICI_IT_1")
    1608                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("ICI_IT_1")
    1609                            .dwattr $C$DW$107, DW_AT_bit_offset(0x10)
    1610                            .dwattr $C$DW$107, DW_AT_bit_size(0x06)
    1611                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1614                            .dwattr $C$DW$107, DW_AT_decl_line(0x140)
    1615                            .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1616                    
    1617                    $C$DW$108       .dwtag  DW_TAG_member
    1618                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
    1619                            .dwattr $C$DW$108, DW_AT_name("GE")
    1620                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("GE")
    1621                            .dwattr $C$DW$108, DW_AT_bit_offset(0x0c)
    1622                            .dwattr $C$DW$108, DW_AT_bit_size(0x04)
    1623                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1625                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1626                            .dwattr $C$DW$108, DW_AT_decl_line(0x141)
    1627                            .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1628                    
    1629                    $C$DW$109       .dwtag  DW_TAG_member
    1630                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$28)
    1631                            .dwattr $C$DW$109, DW_AT_name("_reserved1")
    1632                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("_reserved1")
    1633                            .dwattr $C$DW$109, DW_AT_bit_offset(0x08)
    1634                            .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1635                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1637                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1638                            .dwattr $C$DW$109, DW_AT_decl_line(0x142)
    1639                            .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1640                    
    1641                    $C$DW$110       .dwtag  DW_TAG_member
    1642                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$28)
    1643                            .dwattr $C$DW$110, DW_AT_name("T")
    1644                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("T")
    1645                            .dwattr $C$DW$110, DW_AT_bit_offset(0x07)
    1646                            .dwattr $C$DW$110, DW_AT_bit_size(0x01)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1647                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1649                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1650                            .dwattr $C$DW$110, DW_AT_decl_line(0x143)
    1651                            .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    1652                    
    1653                    $C$DW$111       .dwtag  DW_TAG_member
    1654                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$28)
    1655                            .dwattr $C$DW$111, DW_AT_name("ICI_IT_2")
    1656                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("ICI_IT_2")
    1657                            .dwattr $C$DW$111, DW_AT_bit_offset(0x05)
    1658                            .dwattr $C$DW$111, DW_AT_bit_size(0x02)
    1659                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1661                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1662                            .dwattr $C$DW$111, DW_AT_decl_line(0x144)
    1663                            .dwattr $C$DW$111, DW_AT_decl_column(0x0e)
    1664                    
    1665                    $C$DW$112       .dwtag  DW_TAG_member
    1666                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$28)
    1667                            .dwattr $C$DW$112, DW_AT_name("Q")
    1668                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("Q")
    1669                            .dwattr $C$DW$112, DW_AT_bit_offset(0x04)
    1670                            .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1671                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1673                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1674                            .dwattr $C$DW$112, DW_AT_decl_line(0x145)
    1675                            .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    1676                    
    1677                    $C$DW$113       .dwtag  DW_TAG_member
    1678                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$28)
    1679                            .dwattr $C$DW$113, DW_AT_name("V")
    1680                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("V")
    1681                            .dwattr $C$DW$113, DW_AT_bit_offset(0x03)
    1682                            .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1683                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1685                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1686                            .dwattr $C$DW$113, DW_AT_decl_line(0x146)
    1687                            .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    1688                    
    1689                    $C$DW$114       .dwtag  DW_TAG_member
    1690                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$28)
    1691                            .dwattr $C$DW$114, DW_AT_name("C")
    1692                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("C")
    1693                            .dwattr $C$DW$114, DW_AT_bit_offset(0x02)
    1694                            .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1695                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1697                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1698                            .dwattr $C$DW$114, DW_AT_decl_line(0x147)
    1699                            .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    1700                    
    1701                    $C$DW$115       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1702                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$28)
    1703                            .dwattr $C$DW$115, DW_AT_name("Z")
    1704                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("Z")
    1705                            .dwattr $C$DW$115, DW_AT_bit_offset(0x01)
    1706                            .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1707                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1709                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1710                            .dwattr $C$DW$115, DW_AT_decl_line(0x148)
    1711                            .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    1712                    
    1713                    $C$DW$116       .dwtag  DW_TAG_member
    1714                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$28)
    1715                            .dwattr $C$DW$116, DW_AT_name("N")
    1716                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("N")
    1717                            .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    1718                            .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1719                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1721                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1722                            .dwattr $C$DW$116, DW_AT_decl_line(0x149)
    1723                            .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    1724                    
    1725                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1726                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x13d)
    1727                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    1728                            .dwendtag $C$DW$T$31
    1729                    
    1730                    
    1731                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1732                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    1733                    $C$DW$117       .dwtag  DW_TAG_member
    1734                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$28)
    1735                            .dwattr $C$DW$117, DW_AT_name("nPRIV")
    1736                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("nPRIV")
    1737                            .dwattr $C$DW$117, DW_AT_bit_offset(0x1f)
    1738                            .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1739                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1741                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1742                            .dwattr $C$DW$117, DW_AT_decl_line(0x175)
    1743                            .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    1744                    
    1745                    $C$DW$118       .dwtag  DW_TAG_member
    1746                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$28)
    1747                            .dwattr $C$DW$118, DW_AT_name("SPSEL")
    1748                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("SPSEL")
    1749                            .dwattr $C$DW$118, DW_AT_bit_offset(0x1e)
    1750                            .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1751                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1752                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1753                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1754                            .dwattr $C$DW$118, DW_AT_decl_line(0x176)
    1755                            .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    1756                    
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1757                    $C$DW$119       .dwtag  DW_TAG_member
    1758                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$28)
    1759                            .dwattr $C$DW$119, DW_AT_name("FPCA")
    1760                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("FPCA")
    1761                            .dwattr $C$DW$119, DW_AT_bit_offset(0x1d)
    1762                            .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1763                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1765                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1766                            .dwattr $C$DW$119, DW_AT_decl_line(0x177)
    1767                            .dwattr $C$DW$119, DW_AT_decl_column(0x0e)
    1768                    
    1769                    $C$DW$120       .dwtag  DW_TAG_member
    1770                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$28)
    1771                            .dwattr $C$DW$120, DW_AT_name("_reserved0")
    1772                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("_reserved0")
    1773                            .dwattr $C$DW$120, DW_AT_bit_offset(0x00)
    1774                            .dwattr $C$DW$120, DW_AT_bit_size(0x1d)
    1775                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1777                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1778                            .dwattr $C$DW$120, DW_AT_decl_line(0x178)
    1779                            .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    1780                    
    1781                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1782                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x174)
    1783                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    1784                            .dwendtag $C$DW$T$32
    1785                    
    1786                    
    1787                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1788                            .dwattr $C$DW$T$39, DW_AT_byte_size(0xe04)
    1789                    $C$DW$121       .dwtag  DW_TAG_member
    1790                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$34)
    1791                            .dwattr $C$DW$121, DW_AT_name("ISER")
    1792                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("ISER")
    1793                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1795                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1796                            .dwattr $C$DW$121, DW_AT_decl_line(0x196)
    1797                            .dwattr $C$DW$121, DW_AT_decl_column(0x12)
    1798                    
    1799                    $C$DW$122       .dwtag  DW_TAG_member
    1800                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$35)
    1801                            .dwattr $C$DW$122, DW_AT_name("RESERVED0")
    1802                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("RESERVED0")
    1803                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1804                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1805                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1806                            .dwattr $C$DW$122, DW_AT_decl_line(0x197)
    1807                            .dwattr $C$DW$122, DW_AT_decl_column(0x12)
    1808                    
    1809                    $C$DW$123       .dwtag  DW_TAG_member
    1810                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$34)
    1811                            .dwattr $C$DW$123, DW_AT_name("ICER")
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   34

    1812                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("ICER")
    1813                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1814                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1815                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1816                            .dwattr $C$DW$123, DW_AT_decl_line(0x198)
    1817                            .dwattr $C$DW$123, DW_AT_decl_column(0x12)
    1818                    
    1819                    $C$DW$124       .dwtag  DW_TAG_member
    1820                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$35)
    1821                            .dwattr $C$DW$124, DW_AT_name("RSERVED1")
    1822                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("RSERVED1")
    1823                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1824                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1825                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1826                            .dwattr $C$DW$124, DW_AT_decl_line(0x199)
    1827                            .dwattr $C$DW$124, DW_AT_decl_column(0x12)
    1828                    
    1829                    $C$DW$125       .dwtag  DW_TAG_member
    1830                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$34)
    1831                            .dwattr $C$DW$125, DW_AT_name("ISPR")
    1832                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("ISPR")
    1833                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1834                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1835                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1836                            .dwattr $C$DW$125, DW_AT_decl_line(0x19a)
    1837                            .dwattr $C$DW$125, DW_AT_decl_column(0x12)
    1838                    
    1839                    $C$DW$126       .dwtag  DW_TAG_member
    1840                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$35)
    1841                            .dwattr $C$DW$126, DW_AT_name("RESERVED2")
    1842                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("RESERVED2")
    1843                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1844                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1845                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1846                            .dwattr $C$DW$126, DW_AT_decl_line(0x19b)
    1847                            .dwattr $C$DW$126, DW_AT_decl_column(0x12)
    1848                    
    1849                    $C$DW$127       .dwtag  DW_TAG_member
    1850                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$34)
    1851                            .dwattr $C$DW$127, DW_AT_name("ICPR")
    1852                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("ICPR")
    1853                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    1854                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1855                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1856                            .dwattr $C$DW$127, DW_AT_decl_line(0x19c)
    1857                            .dwattr $C$DW$127, DW_AT_decl_column(0x12)
    1858                    
    1859                    $C$DW$128       .dwtag  DW_TAG_member
    1860                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$35)
    1861                            .dwattr $C$DW$128, DW_AT_name("RESERVED3")
    1862                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("RESERVED3")
    1863                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    1864                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1865                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1866                            .dwattr $C$DW$128, DW_AT_decl_line(0x19d)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   35

    1867                            .dwattr $C$DW$128, DW_AT_decl_column(0x12)
    1868                    
    1869                    $C$DW$129       .dwtag  DW_TAG_member
    1870                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$34)
    1871                            .dwattr $C$DW$129, DW_AT_name("IABR")
    1872                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("IABR")
    1873                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    1874                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1875                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1876                            .dwattr $C$DW$129, DW_AT_decl_line(0x19e)
    1877                            .dwattr $C$DW$129, DW_AT_decl_column(0x12)
    1878                    
    1879                    $C$DW$130       .dwtag  DW_TAG_member
    1880                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$36)
    1881                            .dwattr $C$DW$130, DW_AT_name("RESERVED4")
    1882                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("RESERVED4")
    1883                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    1884                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1885                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1886                            .dwattr $C$DW$130, DW_AT_decl_line(0x19f)
    1887                            .dwattr $C$DW$130, DW_AT_decl_column(0x12)
    1888                    
    1889                    $C$DW$131       .dwtag  DW_TAG_member
    1890                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$37)
    1891                            .dwattr $C$DW$131, DW_AT_name("IP")
    1892                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("IP")
    1893                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    1894                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1895                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1896                            .dwattr $C$DW$131, DW_AT_decl_line(0x1a0)
    1897                            .dwattr $C$DW$131, DW_AT_decl_column(0x12)
    1898                    
    1899                    $C$DW$132       .dwtag  DW_TAG_member
    1900                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$38)
    1901                            .dwattr $C$DW$132, DW_AT_name("RESERVED5")
    1902                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("RESERVED5")
    1903                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    1904                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1905                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1906                            .dwattr $C$DW$132, DW_AT_decl_line(0x1a1)
    1907                            .dwattr $C$DW$132, DW_AT_decl_column(0x12)
    1908                    
    1909                    $C$DW$133       .dwtag  DW_TAG_member
    1910                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$33)
    1911                            .dwattr $C$DW$133, DW_AT_name("STIR")
    1912                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("STIR")
    1913                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1914                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1915                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1916                            .dwattr $C$DW$133, DW_AT_decl_line(0x1a2)
    1917                            .dwattr $C$DW$133, DW_AT_decl_column(0x12)
    1918                    
    1919                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1920                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x195)
    1921                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   36

    1922                            .dwendtag $C$DW$T$39
    1923                    
    1924                    $C$DW$T$176     .dwtag  DW_TAG_typedef
    1925                            .dwattr $C$DW$T$176, DW_AT_name("NVIC_Type")
    1926                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$39)
    1927                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    1928                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1929                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x1a3)
    1930                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x04)
    1931                    
    1932                    
    1933                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1934                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x8c)
    1935                    $C$DW$134       .dwtag  DW_TAG_member
    1936                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$40)
    1937                            .dwattr $C$DW$134, DW_AT_name("CPUID")
    1938                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("CPUID")
    1939                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1940                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1941                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1942                            .dwattr $C$DW$134, DW_AT_decl_line(0x1b8)
    1943                            .dwattr $C$DW$134, DW_AT_decl_column(0x12)
    1944                    
    1945                    $C$DW$135       .dwtag  DW_TAG_member
    1946                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$33)
    1947                            .dwattr $C$DW$135, DW_AT_name("ICSR")
    1948                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("ICSR")
    1949                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1950                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1951                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1952                            .dwattr $C$DW$135, DW_AT_decl_line(0x1b9)
    1953                            .dwattr $C$DW$135, DW_AT_decl_column(0x12)
    1954                    
    1955                    $C$DW$136       .dwtag  DW_TAG_member
    1956                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$33)
    1957                            .dwattr $C$DW$136, DW_AT_name("VTOR")
    1958                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("VTOR")
    1959                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1960                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1961                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1962                            .dwattr $C$DW$136, DW_AT_decl_line(0x1ba)
    1963                            .dwattr $C$DW$136, DW_AT_decl_column(0x12)
    1964                    
    1965                    $C$DW$137       .dwtag  DW_TAG_member
    1966                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$33)
    1967                            .dwattr $C$DW$137, DW_AT_name("AIRCR")
    1968                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("AIRCR")
    1969                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1970                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1971                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1972                            .dwattr $C$DW$137, DW_AT_decl_line(0x1bb)
    1973                            .dwattr $C$DW$137, DW_AT_decl_column(0x12)
    1974                    
    1975                    $C$DW$138       .dwtag  DW_TAG_member
    1976                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$33)
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   37

    1977                            .dwattr $C$DW$138, DW_AT_name("SCR")
    1978                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("SCR")
    1979                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1980                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1981                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1982                            .dwattr $C$DW$138, DW_AT_decl_line(0x1bc)
    1983                            .dwattr $C$DW$138, DW_AT_decl_column(0x12)
    1984                    
    1985                    $C$DW$139       .dwtag  DW_TAG_member
    1986                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$33)
    1987                            .dwattr $C$DW$139, DW_AT_name("CCR")
    1988                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("CCR")
    1989                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1990                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1991                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1992                            .dwattr $C$DW$139, DW_AT_decl_line(0x1bd)
    1993                            .dwattr $C$DW$139, DW_AT_decl_column(0x12)
    1994                    
    1995                    $C$DW$140       .dwtag  DW_TAG_member
    1996                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$41)
    1997                            .dwattr $C$DW$140, DW_AT_name("SHP")
    1998                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("SHP")
    1999                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2000                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2001                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2002                            .dwattr $C$DW$140, DW_AT_decl_line(0x1be)
    2003                            .dwattr $C$DW$140, DW_AT_decl_column(0x12)
    2004                    
    2005                    $C$DW$141       .dwtag  DW_TAG_member
    2006                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$33)
    2007                            .dwattr $C$DW$141, DW_AT_name("SHCSR")
    2008                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("SHCSR")
    2009                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2010                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2011                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2012                            .dwattr $C$DW$141, DW_AT_decl_line(0x1bf)
    2013                            .dwattr $C$DW$141, DW_AT_decl_column(0x12)
    2014                    
    2015                    $C$DW$142       .dwtag  DW_TAG_member
    2016                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$33)
    2017                            .dwattr $C$DW$142, DW_AT_name("CFSR")
    2018                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("CFSR")
    2019                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2020                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2021                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2022                            .dwattr $C$DW$142, DW_AT_decl_line(0x1c0)
    2023                            .dwattr $C$DW$142, DW_AT_decl_column(0x12)
    2024                    
    2025                    $C$DW$143       .dwtag  DW_TAG_member
    2026                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$33)
    2027                            .dwattr $C$DW$143, DW_AT_name("HFSR")
    2028                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("HFSR")
    2029                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2030                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2031                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
TI ARM Assembler PC v16.9.6 Tue Oct 17 14:35:08 2023

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   38

    2032                            .dwattr $C$DW$143, DW_AT_decl_line(0x1c1)
    2033                            .dwattr $C$DW$143, DW_AT_decl_column(0x12)
    2034                    
    2035                    $C$DW$144       .dwtag  DW_TAG_member
    2036                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$33)
    2037                            .dwattr $C$DW$144, DW_AT_name("DFSR")
    2038                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("DFSR")
    2039                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2040                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2041                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2042                            .dwattr $C$DW$144, DW_AT_decl_line(0x1c2)
    2043                            .dwattr $C$DW$144, DW_AT_decl_column(0x12)
    2044                    
    2045                    $C$DW$145       .dwtag  DW_TAG_member
    2046                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$33)
    2047                            .dwattr $C$DW$145, DW_AT_name("MMFAR")
    2048                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("MMFAR")
    2049                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2050                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2051                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
